package com.gray17.soul.catcraft.emoji;

public class EmojiLibrary {
	public static final String[] JOY_EMOJI = { "(* ^ ω ^)", "(´ ∀ ` *)", "٩(◕‿◕｡)۶", "☆*:.｡.o(≧▽≦)o.｡.:*☆", "(o^▽^o)",
			"(⌒▽⌒)☆", "<(￣︶￣)>", "。.:☆*:･'(*⌒―⌒*)))", "ヽ(・∀・)ﾉ", "(´｡• ω •｡`)", "(￣ω￣)", "｀;:゛;｀;･(°ε° )", "(o･ω･o)",
			"(＠＾◡＾)", "ヽ(*・ω・)ﾉ", "(o_ _)ﾉ彡☆", "(^人^)", "(o´▽`o)", "(*´▽`*)", "｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡", "( ´ ω ` )",
			"(((o(*°▽°*)o)))", "(≧◡≦)", "(o´∀`o)", "(´• ω •`)", "(＾▽＾)", "(⌒ω⌒)", "∑d(°∀°d)", "╰(▔∀▔)╯", "(─‿‿─)",
			"(*^‿^*)", "ヽ(o^ ^o)ﾉ", "(✯◡✯)", "(◕‿◕)", "(*≧ω≦*)", "(☆▽☆)", "(⌒‿⌒)", "＼(≧▽≦)／", "ヽ(o＾▽＾o)ノ", "☆ ～('▽^人)",
			"(*°▽°*)", "٩(｡•́‿•̀｡)۶", "(✧ω✧)", "ヽ(*⌒▽⌒*)ﾉ", "(´｡• ᵕ •｡`)", "( ´ ▽ ` )", "(￣▽￣)", "╰(*´︶`*)╯",
			"ヽ(>∀<☆)ノ", "o(≧▽≦)o", "(☆ω☆)", "(っ˘ω˘ς )", "＼(￣▽￣)／", "(*¯︶¯*)", "＼(＾▽＾)／", "٩(◕‿◕)۶", "(o˘◡˘o)",
			"\\(★ω★)/", "\\(^ヮ^)/", "(〃＾▽＾〃)", "(╯✧▽✧)╯", "o(>ω<)o", "o( ❛ᴗ❛ )o", "｡ﾟ(TヮT)ﾟ｡", "( ‾́ ◡ ‾́ )",
			"(ﾉ´ヮ`)ﾉ*: ･ﾟ", "(b ᵔ▽ᵔ)b", "(๑˃ᴗ˂)ﻭ", "(๑˘︶˘๑)", "( ˙꒳​˙ )", "(*꒦ິ꒳꒦ີ)", "°˖✧◝(⁰▿⁰)◜✧˖°", "(´･ᴗ･ ` )",
			"(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧", "(„• ֊ •„)", "(.❛ ᴗ ❛.)", "(⁀ᗢ⁀)", "(￢‿￢ )", "(¬‿¬ )", "(*￣▽￣)b", "( ˙▿˙ )", "(¯▿¯)",
			"( ◕▿◕ )", "＼(٥⁀▽⁀ )／", };

	public static final String[] LOVE_EMOJI = { "(ﾉ´ з `)ノ", "(♡μ_μ)", "(*^^*)♡", "☆⌒ヽ(*'､^*)chu", "(♡-_-♡)", "(￣ε￣＠)",
			"ヽ(♡‿♡)ノ", "( ´ ∀ `)ノ～ ♡", "(─‿‿─)♡", "(´｡• ᵕ •｡`) ♡", "(*♡∀♡)", "(｡・//ε//・｡)", "(´ ω `♡)", "♡( ◡‿◡ )",
			"(◕‿◕)♡", "(/▽＼*)｡o○♡", "(ღ˘⌣˘ღ)", "(♡°▽°♡)", "♡(｡- ω -)", "♡ ～('▽^人)", "(´• ω •`) ♡", "(´ ε ` )♡",
			"(´｡• ω •｡`) ♡", "( ´ ▽ ` ).｡ｏ♡", "╰(*´︶`*)╯♡", "(*˘︶˘*).｡.:*♡", "(♡˙︶˙♡)", "♡＼(￣▽￣)／♡", "(≧◡≦) ♡",
			"(⌒▽⌒)♡", "(*¯ ³¯*)♡", "(っ˘з(˘⌣˘ ) ♡", "♡ (˘▽˘>ԅ( ˘⌣˘)", "( ˘⌣˘)♡(˘⌣˘ )", "(/^-^(^ ^*)/ ♡", "٩(♡ε♡)۶",
			"σ(≧ε≦σ) ♡", "♡ (⇀ 3 ↼)", "♡ (￣З￣)", "(❤ω❤)", "(˘∀˘)/(μ‿μ) ❤", "❤ (ɔˆз(ˆ⌣ˆc)", "(´♡‿♡`)", "(°◡°♡)",
			"Σ>―(〃°ω°〃)♡→", "(´,,•ω•,,)♡", "(´꒳`)♡" };

	// EMBARASSMENT
	public static final String[] EMBARASSMENT_EMOJI = { "(⌒_⌒;)", "(o^ ^o)", "(*/ω＼)", "(*/。＼)", "(*/_＼)", "(*ﾉωﾉ)",
			"(o-_-o)", "(*μ_μ)", "( ◡‿◡ *)", "(ᵔ.ᵔ)", "(*ﾉ∀`*)", "(ノ*°▽°*)", "(*^.^*)", "(*ﾉ▽ﾉ)", "(￣▽￣*)ゞ",
			"(⁄ ⁄•⁄ω⁄•⁄ ⁄)", "(*/▽＼*)", "(⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)", "(„ಡωಡ„)", "(ง ื▿ ื)ว", "( 〃▽〃)", "(/▿＼ )" };

	// Sympathy
	public static final String[] SYMPATHY_EMOJI = {

			"(ノ_<。)ヾ(´ ▽ ` )", "｡･ﾟ･(ﾉД`)ヽ(￣ω￣ )", "ρ(- ω -、)ヾ(￣ω￣; )",

			"ヽ(￣ω￣(。。 )ゝ", "(*´ I `)ﾉﾟ(ﾉД｀ﾟ)ﾟ｡", "ヽ(~_~(・_・ )ゝ",

			"(ﾉ_；)ヾ(´ ∀ ` )", "(; ω ; )ヾ(´∀`* )", "(*´ー)ﾉ(ノд`)",

			"(´-ω-`( _ _ )", "(っ´ω`)ﾉ(╥ω╥)", "(ｏ・_・)ノ”(ノ_<、)" };

	// Dissatisfaction
	public static final String[] DISSATISFACTION_EMOJI = { "(＃＞＜)", "(；⌣̀_⌣́)", "☆ｏ(＞＜；)○", "(￣ ￣|||)", "(；￣Д￣)",
			"(￣□￣」)", "(＃￣0￣)", "(＃￣ω￣)", "(￢_￢;)", "(＞ｍ＜)", "(」°ロ°)」", "(〃＞＿＜;〃)", "(＾＾＃)", "(︶︹︺)", "(￣ヘ￣)",
			"<(￣ ﹌ ￣)>", "(￣︿￣)", "(＞﹏＜)", "(--_--)", "凸(￣ヘ￣)", "ヾ( ￣O￣)ツ", "(⇀‸↼‶)", "o(>< )o", "(」＞＜)」", "(ᗒᗣᗕ)՞",
			"(눈_눈)", };
	// Anger
	public static final String[] AMGER_EMOJI = { "(＃`Д´)", "(`皿´＃)", "( ` ω ´ )", "ヽ( `д´*)ノ",

			"(・`ω´・)", "(`ー´)", "ヽ(`⌒´メ)ノ", "凸(`△´＃)",

			"( `ε´ )", "ψ( ` ∇ ´ )ψ", "ヾ(`ヘ´)ﾉﾞ", "ヽ(‵﹏´)ノ",

			"(ﾒ` ﾛ ´)", "(╬`益´)", "┌∩┐(◣_◢)┌∩┐", "凸( ` ﾛ ´ )凸",

			"Σ(▼□▼メ)", "(°ㅂ°╬)", "ψ(▼へ▼メ)～→", "(ノ°益°)ノ",

			"(҂ `з´ )", "(‡▼益▼)", "(҂` ﾛ ´)凸", "((╬◣﹏◢))",

			"٩(╬ʘ益ʘ╬)۶", "(╬ Ò﹏Ó)", "＼＼٩(๑`^´๑)۶／／", "(凸ಠ益ಠ)凸",

			"↑_(ΦwΦ)Ψ", "←~(Ψ▼ｰ▼)∈", "୧((#Φ益Φ#))୨", "٩(ఠ益ఠ)۶", "(ﾉಥ益ಥ)ﾉ" };

	// Sadness
	public static final String[] SADNESS_EMOJI = { "(ノ_<。)", "(-_-)", "(´-ω-`)", ".･ﾟﾟ･(／ω＼)･ﾟﾟ･.",

			"(μ_μ)", "(ﾉД`)", "(-ω-、)", "。゜゜(´Ｏ`) ゜゜。",

			"o(TヘTo)", "( ; ω ; )", "(｡╯︵╰｡)", "｡･ﾟﾟ*(>д<)*ﾟﾟ･｡",

			"( ﾟ，_ゝ｀)", "(个_个)", "(╯︵╰,)", "｡･ﾟ(ﾟ><ﾟ)ﾟ･｡",

			"( ╥ω╥ )", "(╯_╰)", "(╥_╥)", ".｡･ﾟﾟ･(＞_＜)･ﾟﾟ･｡.",

			"(／ˍ・、)", "(ノ_<、)", "(╥﹏╥)", "｡ﾟ(｡ﾉωヽ｡)ﾟ｡",

			"(つω`｡)", "(｡T ω T｡)", "(ﾉω･､)", "･ﾟ･(｡>ω<｡)･ﾟ･",

			"(T_T)", "(>_<)", "(っ˘̩╭╮˘̩)っ", "｡ﾟ･ (>﹏<) ･ﾟ｡",

			"o(〒﹏〒)o", "(｡•́︿•̀｡)", "(ಥ﹏ಥ)" };

	// Pain
	public static final String[] PAIN_EMOJI = { "~(>_<~)", "☆⌒(> _ <)", "☆⌒(>。<)", "(☆_@)",

			"(×_×)", "(x_x)", "(×_×)⌒☆", "(x_x)⌒☆",

			"(×﹏×)", "☆(＃××)", "(＋_＋)", "[ ± _ ± ]",

			"٩(× ×)۶", "_:(´ཀ`」 ∠):_" };

	// Fear
	public static final String[] FEAR_EMOJI = {

			"(ノωヽ)", "(／。＼)", "(ﾉ_ヽ)", "..・ヾ(。＞＜)シ",

			"(″ロ゛)", "(;;;*_*)", "(・人・)", "＼(〇_ｏ)／",

			"(/ω＼)", "(/_＼)", "〜(＞＜)〜", "Σ(°△°|||)︴",

			"(((＞＜)))", "{{ (>_<) }}", "＼(º □ º l|l)/", "〣( ºΔº )〣",

			"▓▒░(°◡°)░▒▓" };
	// Indifference
	public static final String[] INDIFFERENCE_EMOJI = { "ヽ(ー_ー )ノ", "ヽ(´ー` )┌", "┐(‘～` )┌", "ヽ(　￣д￣)ノ",

			"┐(￣ヘ￣)┌", "ヽ(￣～￣　)ノ", "╮(￣_￣)╭", "ヽ(ˇヘˇ)ノ",

			"┐(￣～￣)┌", "┐(︶▽︶)┌", "╮(￣～￣)╭", "¯\\_(ツ)_/¯",

			"┐( ´ д ` )┌", "╮(︶︿︶)╭", "┐(￣∀￣)┌", "┐( ˘ ､ ˘ )┌",

			"╮(︶▽︶)╭", "╮( ˘ ､ ˘ )╭", "┐( ˘_˘ )┌", "╮( ˘_˘ )╭",

			"┐(￣ヮ￣)┌", "ᕕ( ᐛ )ᕗ" };

	// Confusion
	public static final String[] CONFUSION_EMOJI = {

			"(￣ω￣;)", "σ(￣、￣〃)", "(￣～￣;)", "(-_-;)・・・",

			"┐('～`;)┌", "(・_・ヾ", "(〃￣ω￣〃ゞ", "┐(￣ヘ￣;)┌",

			"(・_・;)", "(￣_￣)・・・", "╮(￣ω￣;)╭", "(¯ . ¯;)",

			"(＠_＠)", "(・・;)ゞ", "Σ(￣。￣ﾉ)", "(・・ ) ?",

			"(•ิ_•ิ)?", "(◎ ◎)ゞ", "(ーー;)", "ლ(ಠ_ಠ ლ)",

			"ლ(¯ロ¯\"ლ)", "(¯ . ¯٥)", "(¯  ¯٥)" };

	// Doubt
	public static final String[] DOUBT_EMOJI = {

			"(￢_￢)", "(→_→)", "(￢ ￢)", "(￢‿￢ )",

			"(¬_¬ )", "(←_←)", "(¬ ¬ )", "(¬‿¬ )",

			"(↼_↼)", "(⇀_⇀)", "(ᓀ ᓀ)" };

	// Surprise
	public static final String[] SURPRISE_EMOJI = { "w(°ｏ°)w", "ヽ(°〇°)ﾉ", "Σ(O_O)", "Σ(°ロ°)",

			"(⊙_⊙)", "(o_O)", "(O_O;)", "(O.O)",

			"(°ロ°) !", "(o_O) !", "(□_□)", "Σ(□_□)",

			"∑(O_O;)", "( : ౦ ‸ ౦ : )" };

	// Greeting
	public static final String[] GREETING_EMOJI = { "(*・ω・)ﾉ", "(￣▽￣)ノ", "(°▽°)/", "( ´ ∀ ` )ﾉ",

			"(^-^*)/", "(＠´ー`)ﾉﾞ", "(´• ω •`)ﾉ", "( ° ∀ ° )ﾉﾞ",

			"ヾ(*'▽'*)", "＼(⌒▽⌒)", "ヾ(☆▽☆)", "( ´ ▽ ` )ﾉ",

			"(^０^)ノ", "~ヾ(・ω・)", "(・∀・)ノ", "ヾ(・ω・*)",

			"(*°ｰ°)ﾉ", "(・_・)ノ", "(o´ω`o)ﾉ", "( ´ ▽ ` )/",

			"(￣ω￣)/", "( ´ ω ` )ノﾞ", "(⌒ω⌒)ﾉ", "(o^ ^o)/",

			"(≧▽≦)/", "(✧∀✧)/", "(o´▽`o)ﾉ", "(￣▽￣)/" };

	public static String getRandomEmoji(String[] array) {
		int ilen = array.length;
		int ranx = (int)(Math.random() * ilen);
		return array[ranx];
	}

	/* replace normal emote with emoji */
	public static String findAndReplaceEmojiRND(String original) {
		String result = "";

		String[] cases = {":)", ":D", ":(", ">:(", ":O", "o/"};
		int i;
		for(i = 0; i < cases.length; i++)
			if (original.contains(cases[i]))
				break;

		String emojiResult = "";
		switch (i) {
			case 0 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.SYMPATHY_EMOJI);
			case 1 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.JOY_EMOJI);
			case 2 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.SADNESS_EMOJI);
			case 3 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.AMGER_EMOJI);
			case 4 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.SURPRISE_EMOJI);
			case 5 -> emojiResult += EmojiLibrary.getRandomEmoji(EmojiLibrary.GREETING_EMOJI);
			default -> emojiResult = "";
		}

		if (!emojiResult.isEmpty()) result = original.replace(cases[i], emojiResult);

		return result;
	}
}